In [1]:
import pandas as pd
import numpy as np

In [2]:
article = pd.read_excel('article.xlsx')
article.rename(columns=article.iloc[0], inplace=True)
article.drop(article.index[0], inplace=True)
article = article.drop(['ArticleId', 'M_L_C'], axis=1)
article = article.loc[:, article.columns.notnull()]
article

                 ArticleName Shoe Type
1                     10 MIX    SANDAL
2                     10 MIX    SANDAL
3     10 MIX 2ND GRADE STOCK    SANDAL
4             1059 DARK BLUE      SHOE
5                   1059 TAN      SHOE
...                      ...       ...
4975          9937/115 BLACK      BOOT
4976          9937/115 BLACK      BOOT
4977          9937/115 BORDO      BOOT
4978      9982/111  BURGUNDY      SHOE
4979      9982/111  D. BROWN      SHOE

[4979 rows x 2 columns]

In [5]:
list(pd.Series([i.upper() for i in article['Shoe Type']]).unique())

['SANDAL', 'SHOE', 'SLIPPER', 'BOOT', 'ND']

In [7]:
article['Shoe Type'].value_counts()

SHOE       2872
BOOT       1014
SLIPPER     761
SANDAL      307
ND           25
Name: Shoe Type, dtype: int64